app/Controllers/Home.php

    public function contact(): string
{
    $data = [];

    if ($this->request->getMethod() === 'post') {
        // Retrieve form input
        $name = $this->request->getPost('name');
        $email = $this->request->getPost('email');
        $subject = $this->request->getPost('subject');
        $message = $this->request->getPost('message');

        // Perform validation
        if (empty($name) || empty($email) || empty($subject) || empty($message)) {
            // Set error message if any field is empty sove thias error
            $data['error'] = 'All fields are required.';
        } else {
            // Insert data into the database
            $insert_array = [
                'name' => $name,
                'email' => $email,
                'subject' => $subject,
                'message' => $message // Store hashed password
            ];

            $builder = $this->db->table('contact');
            $result = $builder->insert($insert_array);
---
INSERT INTO `contact` (`name`, `email`, `subject`, `message`) VALUES ('priyanka ahire', 'ahirepriya84@gmail.com', 'science', 'zzzzxxxccvv')